tutorials/buoyantBoussinesqPiso4PCMFoam/squareEPCM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default				Euler;
}

gradSchemes
{
    default				Gauss linear;
    grad(p)				Gauss linear;
}

divSchemes
{
    default				none;
    div(phi,U)				Gauss upwind;
    div(phi,T)				Gauss upwind;
    div((nuEff*dev(T(grad(U)))))	Gauss linear;
    div(phi,k)				Gauss upwind;
    div(phi,epsilon)			Gauss upwind;
    div(phi,R)				Gauss upwind;
    div(phiU,p)				Gauss linear;
    div(R)				Gauss linear;
    div(phi,alphaEPCM)			Gauss upwind;
}

laplacianSchemes
{
    default				Gauss linear corrected;
}

interpolationSchemes
{
    default				linear;
    interpolate(HbyA)			linear;
}

snGradSchemes
{
    default				corrected;
}


// ************************************************************************* //
